CREATE TABLE IF NOT EXISTS "{{ params.dds_schema_name }}".employees (
    id INT PRIMARY KEY,
    last_name VARCHAR,
    first_name VARCHAR,
    foc VARCHAR(50),
    dep_id INT NOT NULL,
    pos_id INT NOT NULL,
    CONSTRAINT fk_employees_departments
    FOREIGN KEY (dep_id)
    REFERENCES "{{ params.dds_schema_name }}".departments (
        id
    ),
    CONSTRAINT fk_employees_position
    FOREIGN KEY (pos_id)
    REFERENCES "{{ params.dds_schema_name }}".position (
        id
    )
);

-- Creating temp table 'temp_employees' with all employees
CREATE TEMP TABLE temp_employees ON COMMIT DROP AS (
    SELECT
        empl.id,
        empl."фамилия" AS last_name,
        empl."имя" AS first_name,
        empl."цфо" AS foc,
        dep.id AS dep_id,
        pos.id AS pos_id,
        cv."Активность" AS is_active_cv,
        row_to_json(empl) AS row_data
    FROM
        "{{ params.ods_schema_name }}"."сотрудники_дар" AS empl
    LEFT JOIN temp_departments as td ON empl."подразделения" = td."old"
    LEFT JOIN temp_positions as tp ON empl."должность" = tp."old"
    LEFT JOIN "{{ params.dds_schema_name }}".departments AS dep ON dep.department = coalesce(td."new", empl."подразделения")
    LEFT JOIN "{{ params.dds_schema_name }}".position AS pos ON pos.position = coalesce(tp."new", empl."должность")
    LEFT JOIN "{{ params.ods_schema_name }}"."резюмедар" AS cv ON empl.id = cv."UserID"

);

-- Removing all invalid rows FROM temp table and filling 'failed_entities' table
WITH
invalid_employes AS (
    DELETE FROM temp_employees
    WHERE
        is_active_cv != 'Да' OR is_active_cv IS NULL
    RETURNING *
)

INSERT INTO
"{{ params.dds_schema_name }}".failed_entities (entity_name, reason, entity)
SELECT
    'employees' AS entity_name,
    'is_active_cv__is__false' AS reason,
    row_data AS entity
FROM
    invalid_employes;

WITH
invalid_employees AS (
    DELETE FROM temp_employees
    WHERE
        dep_id IS NULL
    RETURNING *
)

INSERT INTO
"{{ params.dds_schema_name }}".failed_entities (entity_name, reason, entity)
SELECT
    'employees' AS entity_name,
    'dep_id__is__null' AS reason,
    row_data AS entity
FROM
    invalid_employees;

WITH
invalid_employes AS (
    DELETE FROM temp_employees
    WHERE
        pos_id IS NULL
    RETURNING *
)

INSERT INTO
"{{ params.dds_schema_name }}".failed_entities (entity_name, reason, entity)
SELECT
    'employees' AS entity_name,
    'pos_id__is__null' AS reason,
    row_data AS entity
FROM
    invalid_employes;

-- Filling 'employees' table with correct employees
INSERT INTO
"{{ params.dds_schema_name }}".employees (id, last_name, first_name, foc, dep_id, pos_id)
SELECT
    id,
    last_name,
    first_name,
    foc,
    dep_id,
    pos_id
FROM
    temp_employees
ON CONFLICT (id) DO
UPDATE
SET
last_name = excluded.last_name,
first_name = excluded.first_name,
dep_id = excluded.dep_id,
pos_id = excluded.pos_id;


SELECT setseed(0.5);

WITH
male_first_names(name) AS (VALUES ('Аверкий'), ('Аверьян'), ('Авксентий'), ('Автоном'), ('Агап'), ('Агафон'), ('Аггей'), ('Адам'), ('Адриан'), ('Азарий'), ('Аким'), ('Александр'), ('Алексей'), ('Амвросий'), ('Амос'), ('Ананий'), ('Анатолий'), ('Андрей'), ('Андрон'), ('Андроник'), ('Аникей'), ('Аникита'), ('Анисим'), ('Антип'), ('Антонин'), ('Аполлинарий'), ('Аполлон'), ('Арефий'), ('Аристарх'), ('Аркадий'), ('Арсений'), ('Артемий'), ('Артем'), ('Архип'), ('Аскольд'), ('Афанасий'), ('Афиноген'), ('Бажен'), ('Богдан'), ('Болеслав'), ('Борис'), ('Борислав'), ('Боян'), ('Бронислав'), ('Будимир'), ('Вадим'), ('Валентин'), ('Валерий'), ('Валерьян'), ('Варлаам'), ('Варфоломей'), ('Василий'), ('Вацлав'), ('Велимир'), ('Венедикт'), ('Вениамин'), ('Викентий'), ('Виктор'), ('Викторин'), ('Виссарион'), ('Виталий'), ('Владилен'), ('Владлен'), ('Владимир'), ('Владислав'), ('Влас'), ('Всеволод'), ('Всемил'), ('Всеслав'), ('Вышеслав'), ('Вячеслав'), ('Гаврила'), ('Галактион'), ('Гедеон'), ('Геннадий'), ('Георгий'), ('Герасим'), ('Герман'), ('Глеб'), ('Гордей'), ('Гостомысл'), ('Гремислав'), ('Григорий'), ('Гурий'), ('Давыд'), ('Данила'), ('Дементий'), ('Демид'), ('Демьян'), ('Денис'), ('Дмитрий'), ('Добромысл'), ('Доброслав'), ('Дорофей'), ('Евгений'), ('Евграф'), ('Евдоким'), ('Евлампий'), ('Евсей'), ('Евстафий'), ('Евстигней'), ('Егор'), ('Елизар'), ('Елисей'), ('Емельян'), ('Епифан'), ('Еремей'), ('Ермил'), ('Ермолай'), ('Ерофей'), ('Ефим'), ('Ефрем'), ('Захар'), ('Зиновий'), ('Зосима'), ('Иван'), ('Игнатий'), ('Игорь'), ('Измаил'), ('Изот'), ('Изяслав'), ('Иларион'), ('Илья'), ('Иннокентий'), ('Иосиф'), ('Ипат'), ('Ипатий'), ('Ипполит'), ('Ираклий'), ('Исай'), ('Исидор'), ('Казимир'), ('Каллистрат'), ('Капитон'), ('Карл'), ('Карп'), ('Касьян'), ('Ким'), ('Кир'), ('Кирилл'), ('Клавдий'), ('Климент'), ('Кондрат'), ('Кондратий'), ('Конон'), ('Константин'), ('Корнил'), ('Кузьма'), ('Куприян'), ('Лавр'), ('Лаврентий'), ('Ладимир'), ('Ладислав'), ('Лазарь'), ('Лев'), ('Леон'), ('Леонид'), ('Леонтий'), ('Лонгин'), ('Лука'), ('Лукьян'), ('Лучезар'), ('Любим'), ('Любомир'), ('Любосмысл'), ('Макар'), ('Максим'), ('Максимильян'), ('Мариан'), ('Марк'), ('Мартын'), ('Мартьян'), ('Матвей'), ('Мефодий'), ('Мечислав'), ('Милан'), ('Милен'), ('Милий'), ('Милован'), ('Мина'), ('Мир'), ('Мирон'), ('Мирослав'), ('Митофан'), ('Михаил'), ('Михей'), ('Модест'), ('Моисей'), ('Мокей'), ('Мстислав'), ('Назар'), ('Наркис'), ('Натан'), ('Наум'), ('Нестор'), ('Никандр'), ('Никанор'), ('Никита'), ('Никифор'), ('Никодим'), ('Николай'), ('Никон'), ('Нифонт'), ('Олег'), ('Олимпий'), ('Онуфрий'), ('Орест'), ('Осип'), ('Остап'), ('Остромир'), ('Павел'), ('Панкратий'), ('Панкрат'), ('Пантелеймон'), ('Панфил'), ('Парамон'), ('Парфен'), ('Пахом'), ('Петр'), ('Пимен'), ('Платон'), ('Поликарп'), ('Порфирий'), ('Потап'), ('Пров'), ('Прокл'), ('Прокофий'), ('Прохор'), ('Радим'), ('Радислав'), ('Радован'), ('Ратибор'), ('Ратмир'), ('Родион'), ('Роман'), ('Ростислав'), ('Рубен'), ('Руслан'), ('Рюрик'), ('Савва'), ('Савватий'), ('Савелий'), ('Самсон'), ('Самуил'), ('Светозар'), ('Святополк'), ('Святослав'), ('Севастьян'), ('Селиван'), ('Селиверст'), ('Семен'), ('Серафим'), ('Сергей'), ('Сигизмунд'), ('Сидор'), ('Сила'), ('Силантий'), ('Сильвестр'), ('Симон'), ('Сократ'), ('Соломон'), ('Софон'), ('Софрон'), ('Спартак'), ('Спиридон'), ('Станимир'), ('Станислав'), ('Степан'), ('Стоян'), ('Тарас'), ('Твердислав'), ('Творимир'), ('Терентий'), ('Тимофей'), ('Тимур'), ('Тит'), ('Тихон'), ('Трифон'), ('Трофим'), ('Ульян'), ('Устин'), ('Фадей'), ('Федор'), ('Федосий'), ('Федот'), ('Феликс'), ('Феоктист'), ('Феофан'), ('Ферапонт'), ('Филарет'), ('Филимон'), ('Филипп'), ('Фирс'), ('Флорентин'), ('Фока'), ('Фома'), ('Фортунат'), ('Фотий'), ('Фрол'), ('Харитон'), ('Харлампий'), ('Христофор'), ('Чеслав'), ('Эдуард'), ('Эммануил'), ('Эмиль'), ('Эраст'), ('Эрнест'), ('Эрнст'), ('Ювеналий'), ('Юлиан'), ('Юлий'), ('Юрий'), ('Яков'), ('Ян'), ('Якуб'), ('Януарий'), ('Ярополк'), ('Ярослав')),
male_last_names(name) AS (VALUES ('Смирнов'), ('Иванов'), ('Кузнецов'), ('Попов'), ('Соколов'), ('Лебедев'), ('Козлов'), ('Новиков'), ('Морозов'), ('Петров'), ('Волков'), ('Соловьев'), ('Васильев'), ('Зайцев'), ('Павлов'), ('Семенов'), ('Голубев'), ('Виноградов'), ('Богданов'), ('Воробьев'), ('Федоров'), ('Михайлов'), ('Беляев'), ('Тарасов'), ('Белов'), ('Комаров'), ('Орлов'), ('Киселев'), ('Макаров'), ('Андреев'), ('Ковалев'), ('Ильин'), ('Гусев'), ('Титов'), ('Кузьмин'), ('Кудрявцев'), ('Баранов'), ('Куликов'), ('Алексеев'), ('Степанов'), ('Яковлев'), ('Сорокин'), ('Сергеев'), ('Романов'), ('Захаров'), ('Борисов'), ('Королев'), ('Герасимов'), ('Пономарев'), ('Григорьев'), ('Лазарев'), ('Медведев'), ('Ершов'), ('Никитин'), ('Соболев'), ('Рябов'), ('Поляков'), ('Цветков'), ('Данилов'), ('Жуков'), ('Фролов'), ('Журавлев'), ('Николаев'), ('Крылов'), ('Максимов'), ('Сидоров'), ('Осипов'), ('Белоусов'), ('Федотов'), ('Дорофеев'), ('Егоров'), ('Матвеев'), ('Бобров'), ('Дмитриев'), ('Калинин'), ('Анисимов'), ('Петухов'), ('Антонов'), ('Тимофеев'), ('Никифоров'), ('Веселов'), ('Филиппов'), ('Марков'), ('Большаков'), ('Суханов'), ('Миронов'), ('Ширяев'), ('Александров'), ('Коновалов'), ('Шестаков'), ('Казаков'), ('Ефимов'), ('Денисов'), ('Громов'), ('Фомин'), ('Давыдов'), ('Мельников'), ('Щербаков'), ('Блинов'), ('Колесников'), ('Карпов'), ('Афанасьев'), ('Власов'), ('Маслов'), ('Исаков'), ('Тихонов'), ('Аксенов'), ('Гаврилов'), ('Родионов'), ('Котов'), ('Горбунов'), ('Кудряшов'), ('Быков'), ('Зуев'), ('Третьяков'), ('Савельев'), ('Панов'), ('Рыбаков'), ('Суворов'), ('Абрамов'), ('Воронов'), ('Мухин'), ('Архипов'), ('Трофимов'), ('Мартынов'), ('Емельянов'), ('Горшков'), ('Чернов'), ('Овчинников'), ('Селезнев'), ('Панфилов'), ('Копылов'), ('Михеев'), ('Галкин'), ('Назаров'), ('Лобанов'), ('Лукин'), ('Беляков'), ('Потапов'), ('Некрасов'), ('Хохлов'), ('Жданов'), ('Наумов'), ('Шилов'), ('Воронцов'), ('Ермаков'), ('Дроздов'), ('Игнатьев'), ('Савин'), ('Логинов'), ('Сафонов'), ('Капустин'), ('Кириллов'), ('Моисеев'), ('Елисеев'), ('Кошелев'), ('Костин'), ('Горбачев'), ('Орехов'), ('Ефремов'), ('Исаев'), ('Евдокимов'), ('Калашников'), ('Кабанов'), ('Носков'), ('Юдин'), ('Кулагин'), ('Лапин'), ('Прохоров'), ('Нестеров'), ('Харитонов'), ('Агафонов'), ('Муравьев'), ('Ларионов'), ('Федосеев'), ('Зимин'), ('Пахомов'), ('Шубин'), ('Игнатов'), ('Филатов'), ('Крюков'), ('Рогов'), ('Кулаков'), ('Терентьев'), ('Молчанов'), ('Владимиров'), ('Артемьев'), ('Гурьев'), ('Зиновьев'), ('Гришин'), ('Кононов'), ('Дементьев'), ('Ситников'), ('Симонов'), ('Мишин'), ('Фадеев'), ('Комиссаров'), ('Мамонтов'), ('Носов'), ('Гуляев'), ('Шаров'), ('Устинов'), ('Вишняков'), ('Евсеев'), ('Лаврентьев'), ('Брагин'), ('Константинов'), ('Корнилов'), ('Авдеев'), ('Зыков'), ('Бирюков'), ('Шарапов'), ('Никонов'), ('Щукин'), ('Дьячков'), ('Одинцов'), ('Сазонов'), ('Якушев'), ('Красильников'), ('Гордеев'), ('Самойлов'), ('Князев'), ('Беспалов'), ('Уваров'), ('Шашков'), ('Бобылев'), ('Доронин'), ('Белозеров'), ('Рожков'), ('Самсонов'), ('Мясников'), ('Лихачев'), ('Буров'), ('Сысоев'), ('Фомичев'), ('Русаков'), ('Стрелков'), ('Гущин'), ('Тетерин'), ('Колобов'), ('Субботин'), ('Фокин'), ('Блохин'), ('Селиверстов'), ('Пестов'), ('Кондратьев'), ('Силин'), ('Меркушев'), ('Лыткин'), ('Туров')),
female_first_names(name) AS (VALUES ('Агата'), ('Агафья'), ('Акулина'), ('Алевтина'), ('Александра'), ('Алина'), ('Алла'), ('Анастасия'), ('Ангелина'), ('Анжела'), ('Анжелика'), ('Анна'), ('Антонина'), ('Валентина'), ('Валерия'), ('Варвара'), ('Василиса'), ('Вера'), ('Вероника'), ('Виктория'), ('Галина'), ('Глафира'), ('Дарья'), ('Евгения'), ('Евдокия'), ('Евпраксия'), ('Евфросиния'), ('Екатерина'), ('Елена'), ('Елизавета'), ('Жанна'), ('Зинаида'), ('Зоя'), ('Иванна'), ('Ираида'), ('Ирина'), ('Ия'), ('Кира'), ('Клавдия'), ('Ксения'), ('Лариса'), ('Лидия'), ('Лора'), ('Лукия'), ('Любовь'), ('Людмила'), ('Майя'), ('Маргарита'), ('Марина'), ('Мария'), ('Марфа'), ('Милица'), ('Надежда'), ('Наина'), ('Наталья'), ('Нина'), ('Нинель'), ('Нонна'), ('Оксана'), ('Октябрина'), ('Олимпиада'), ('Ольга'), ('Пелагея'), ('Полина'), ('Прасковья'), ('Раиса'), ('Регина'), ('Светлана'), ('Синклитикия'), ('София'), ('Таисия'), ('Тамара'), ('Татьяна'), ('Ульяна'), ('Фаина'), ('Феврония'), ('Фёкла'), ('Элеонора'), ('Эмилия'), ('Юлия')),
female_last_names( name) AS (VALUES ('Смирнова'), ('Иванова'), ('Кузнецова'), ('Попова'), ('Соколова'), ('Лебедева'), ('Козлова'), ('Новикова'), ('Морозова'), ('Петрова'), ('Волкова'), ('Соловьева'), ('Васильева'), ('Зайцева'), ('Павлова'), ('Семенова'), ('Голубева'), ('Виноградова'), ('Богданова'), ('Воробьева'), ('Федорова'), ('Михайлова'), ('Беляева'), ('Тарасова'), ('Белова'), ('Комарова'), ('Орлова'), ('Киселева'), ('Макарова'), ('Андреева'), ('Ковалева'), ('Ильина'), ('Гусева'), ('Титова'), ('Кузьмина'), ('Кудрявцева'), ('Баранова'), ('Куликова'), ('Алексеева'), ('Степанова'), ('Яковлева'), ('Сорокина'), ('Сергеева'), ('Романова'), ('Захарова'), ('Борисова'), ('Королева'), ('Герасимова'), ('Пономарева'), ('Григорьева'), ('Лазарева'), ('Медведева'), ('Ершова'), ('Никитина'), ('Соболева'), ('Рябова'), ('Полякова'), ('Цветкова'), ('Данилова'), ('Жукова'), ('Фролова'), ('Журавлева'), ('Николаева'), ('Крылова'), ('Максимова'), ('Сидорова'), ('Осипова'), ('Белоусова'), ('Федотова'), ('Дорофеева'), ('Егорова'), ('Матвеева'), ('Боброва'), ('Дмитриева'), ('Калинина'), ('Анисимова'), ('Петухова'), ('Антонова'), ('Тимофеева'), ('Никифорова'), ('Веселова'), ('Филиппова'), ('Маркова'), ('Большакова'), ('Суханова'), ('Миронова'), ('Ширяева'), ('Александрова'), ('Коновалова'), ('Шестакова'), ('Казакова'), ('Ефимова'), ('Денисова'), ('Громова'), ('Фомина'), ('Давыдова'), ('Мельникова'), ('Щербакова'), ('Блинова'), ('Колесникова'), ('Карпова'), ('Афанасьева'), ('Власова'), ('Маслова'), ('Исакова'), ('Тихонова'), ('Аксенова'), ('Гаврилова'), ('Родионова'), ('Котова'), ('Горбунова'), ('Кудряшова'), ('Быкова'), ('Зуева'), ('Третьякова'), ('Савельева'), ('Панова'), ('Рыбакова'), ('Суворова'), ('Абрамова'), ('Воронова'), ('Мухина'), ('Архипова'), ('Трофимова'), ('Мартынова'), ('Емельянова'), ('Горшкова'), ('Чернова'), ('Овчинникова'), ('Селезнева'), ('Панфилова'), ('Копылова'), ('Михеева'), ('Галкина'), ('Назарова'), ('Лобанова'), ('Лукина'), ('Белякова'), ('Потапова'), ('Некрасова'), ('Хохлова'), ('Жданова'), ('Наумова'), ('Шилова'), ('Воронцова'), ('Ермакова'), ('Дроздова'), ('Игнатьева'), ('Савина'), ('Логинова'), ('Сафонова'), ('Капустина'), ('Кириллова'), ('Моисеева'), ('Елисеева'), ('Кошелева'), ('Костина'), ('Горбачева'), ('Орехова'), ('Ефремова'), ('Исаева'), ('Евдокимова'), ('Калашникова'), ('Кабанова'), ('Носкова'), ('Юдина'), ('Кулагина'), ('Лапина'), ('Прохорова'), ('Нестерова'), ('Харитонова'), ('Агафонова'), ('Муравьева'), ('Ларионова'), ('Федосеева'), ('Зимина'), ('Пахомова'), ('Шубина'), ('Игнатова'), ('Филатова'), ('Крюкова'), ('Рогова'), ('Кулакова'), ('Терентьева'), ('Молчанова'), ('Владимирова'), ('Артемьева'), ('Гурьева'), ('Зиновьева'), ('Гришина'), ('Кононова'), ('Дементьева'), ('Ситникова'), ('Симонова'), ('Мишина'), ('Фадеева'), ('Комиссарова'), ('Мамонтова'), ('Носова'), ('Гуляева'), ('Шарова'), ('Устинова'), ('Вишнякова'), ('Евсеева'), ('Лаврентьева'), ('Брагина'), ('Константинова'), ('Корнилова'), ('Авдеева'), ('Зыкова'), ('Бирюкова'), ('Шарапова'), ('Никонова'), ('Щукина'), ('Дьячкова'), ('Одинцова'), ('Сазонова'), ('Якушева'), ('Красильникова'), ('Гордеева'), ('Самойлова'), ('Князева'), ('Беспалова'), ('Уварова'), ('Шашкова'), ('Бобылева'), ('Доронина'), ('Белозерова'), ('Рожкова'), ('Самсонова'), ('Мясникова'), ('Лихачева'), ('Бурова'), ('Сысоева'), ('Фомичева'), ('Русакова'), ('Стрелкова'), ('Гущина'), ('Тетерина'), ('Колобова'), ('Субботина'), ('Фокина'), ('Блохина'), ('Селиверстова'), ('Пестова'), ('Кондратьева'), ('Силина'), ('Меркушева'), ('Лыткина'), ('Турова')),

male_names AS (
    SELECT
        fn.name AS first_name,
        ln.name AS last_name
    FROM
        male_first_names AS fn
    CROSS JOIN male_last_names AS ln
    ORDER BY random()
    LIMIT (SELECT (count(id) / 2) + 1 FROM "{{ params.dds_schema_name }}".employees)
),

female_names AS (
    SELECT
        fn.name AS first_name,
        ln.name AS last_name
    FROM
        female_first_names AS fn
    CROSS JOIN female_last_names AS ln
    ORDER BY
        random()
    LIMIT (SELECT (count(id) / 2) + 1 FROM "{{ params.dds_schema_name }}".employees)
),

new_names AS (
    SELECT
        *,
        row_number() OVER (ORDER BY random()) AS row_number
    FROM (
        SELECT * FROM male_names
        UNION ALL
        SELECT * FROM female_names
    ) AS _
),

old_empl AS (
    SELECT
        id,
        row_number() OVER () AS row_number
    FROM "{{ params.dds_schema_name }}".employees
),

data_to_update AS (
    SELECT
        empl.id,
        n.first_name,
        n.last_name
    FROM
        old_empl AS empl
    INNER JOIN new_names AS n ON empl.row_number = n.row_number
)

UPDATE "{{ params.dds_schema_name }}".employees AS empl
SET
    (first_name, last_name) = (n.first_name, n.last_name)
FROM
    data_to_update AS n
WHERE
    n.id = empl.id;
